const n=`---\r
category: '日常'\r
tags: ['其它']\r
icon: 'logo'\r
open: false\r
cover: 'momo'\r
---\r
 \r
######  {{ $frontmatter.id? $frontmatter.id : $frontmatter.zoid }}\r
\r
 \r
<br/>\r
\r
# 个人行为准则\r
\r
\r
##  社交  \r
\r
### 禁止议人\r
\r
- **\`简述\`**: 不谈论任何人的品行、私事。\r
\r
- **\`判定\`**: 但凡遇到涉及具体的人，不附和、不诋毁。\r
\r
- **\`惩戒\`**: 暂无\r
\r
- **\`除外\`**: 无\r
\r
### 言过必失\r
\r
- **\`简述\`**: 说话前一定要过脑子。\r
\r
- **\`判定\`**: 但凡遇到涉及具体的人，不附和、不诋毁。\r
\r
- **\`惩戒\`**: 暂无\r
\r
- **\`除外\`**: 无\r
\r
## 卫生  <i class="iconfont icon-bash"></i>\r
\r
### \r
\r
## 生活  <i class="iconfont icon-home"></i>\r
\r
\r
\r
\r
### 规律就寝\r
\r
- **\`简述\`**: 晚上 \`22:00\` 准时上床\r
\r
- **\`判定\`**: 晚于 \`22:30\` 上床视为不规律就寝\r
\r
- **\`惩戒\`**: 暂无\r
\r
- **\`除外\`**: ① 被动社交时可以例外 ② 必须完成的工作时可以除外 \r
\r
### 熬夜禁止\r
\r
- **\`简述\`**: 禁止熬夜行为\r
\r
- **\`判定\`**: 晚于 \`0:00\` 入睡视为熬夜\r
\r
- **\`惩戒\`**: 暂无\r
\r
- **\`除外\`**: ① 被动社交时可以例外 ② 必须完成的工作时可以除外 `;export{n as default};
