const r=`---\r
cover: 'easonchen'\r
category: '评价'\r
tags: ['陈奕迅','音乐']\r
---\r
\r
\r
## T0 - 神作 - 10首\r
\r
> 顶级\r
\r
### 《苦瓜》\r
\r
\r
\r
## T1 - 佳作\r
\r
> **佳作！**\r
\r
### 《阿猫阿狗》\r
\r
### 《时代巨轮》\r
\r
### 《时光倒流二十年》\r
\r
\r
\r
## T2 - 经典 \r
\r
> 经典\r
\r
### 《我的快乐时代》\r
\r
### 《心的距离》\r
\r
### 《红玫瑰》\r
\r
### 《时代曲》\r
\r
### 《斯德哥尔摩情人》\r
\r
题材很独特 旋律\r
\r
### 《爱是怀疑》\r
\r
很抓耳的一首歌 唱的也很爽\r
\r
### 《K歌之王》\r
\r
### 《岁月如歌》\r
\r
### 《阴天快乐》\r
\r
### 《婚礼的祝福》\r
\r
### 《全世界失眠》\r
\r
### 《碌卡》\r
\r
### 《幸福摩天轮》\r
\r
### 《低等动物》\r
\r
### 《我们万岁》\r
\r
### 《床头床尾》\r
\r
### 《不如不见》\r
\r
### 《习惯说》\r
\r
《那一夜有没有说》\r
\r
> 云在赶月 \r
>\r
> 路低声说\r
>\r
> 就翻风雪 \r
\r
\r
\r
### 《积木》\r
\r
### 《Because You're Good To Me》\r
\r
### 《完》\r
\r
### 《兄弟》\r
\r
## T3 - 普通\r
\r
> 合格\r
\r
\r
\r
### 《少见不怪》\r
\r
### 《让我留在你身边》\r
\r
### 《陪你渡过漫长岁月》\r
\r
### 《Good Times》\r
\r
### 《浮城》\r
\r
### 《跳蚤市场》\r
\r
### 《他一个人》\r
\r
### 《谢谢》\r
\r
### 《破坏王》\r
\r
\r
\r
### 《不如这样》\r
\r
\r
\r
### 《我们都寂寞》\r
\r
### 《盲婚哑嫁》\r
\r
歌名不错 但是歌词一般 旋律也\r
\r
### 《预感》\r
\r
### 《美丽有罪》\r
\r
### 《听听》\r
\r
### 《你会不会》\r
\r
### 《没有你》\r
\r
## T4 - 难评\r
\r
> 不好听\r
\r
### 《一滴眼泪》\r
\r
### 《爱情，幼稚》\r
\r
### 《我也不会那么做》\r
\r
## T？- 不评\r
\r
> 不予评价\r
\r
### 《敬烟》`;export{r as default};
